Repository: rhash/RHash
Catalog: po/*.po
Languages: pt_br

source: wrong embedded CRC32, should be %s
pt_br: CRC32 embutida está errada, deveria ser %s

source: can't move %s to %s: %s
pt_br: não consigo mover %s para %s: %s

source: %s saved
pt_br: %s salvo

source: can't convert the file path to local encoding: %s
pt_br: não consigo converter o caminho do arquivo para a codificação local: %s

source: unknown hash in magnet link: %s
pt_br: hash desconhecido em link magnético: %s

source: file name doesn't contain a CRC32: %s
pt_br: nome de arquivo não contém uma CRC32: %s

source: skipping binary file
pt_br: pulando arquivo binário

source: file is binary
pt_br: arquivo é binário

source: %s:%u: can't parse line "%s"
pt_br: %s:%u: não consigo processar a linha "%s"

source: ; Generated by %s v%s on %4u-%02u-%02u at %02u:%02u.%02u
pt_br: ; Gerado por %s v%s em %4u-%02u-%02u às %02u:%02u.%02u

source: ; Written by Kravchenko Aleksey (Akademgorodok) - http://rhash.sf.net/ ;
pt_br: ; Escrito por Kravchenko Aleksey (Akademgorodok) - http://rhash.sf.net/ ;

source: Updated: %s
pt_br: Atualizado: %s

source: Interrupted by user...
pt_br: Interrompido por usuário(a)...

source: ERROR
pt_br: ERRO

source: , size is %s should be %s
pt_br: , tamanho é %s, deveria ser %s

source: , embedded CRC32 should be %s
pt_br: , CRC32 embutida deveria ser %s

source: , %s is %s should be %s
pt_br: , %s é %s, deveria ser %s

source: Checking %s
pt_br: Checando %s

source: Processing %s
pt_br: Processando %s

source: --( Verifying %s )
pt_br: --( Verificando %s )

source: Everything OK
pt_br: Tudo OK

source: Nothing to verify
pt_br: Nada a verificar

source: Errors Occurred: Errors:%-3u Miss:%-3u Success:%-3u Total:%-3u
pt_br: Erros Ocorreram: Erros:%-3u Ausentes:%-3u Sucesso:%-3u Total:%-3u

source: Calculating:
pt_br: Calculando:

source: Total %.3f sec, %4.2f MBps
pt_br: Total %.3f s, %4.2f MBps

source: Calculated in %.3f sec, %4.2f MBps
pt_br: Calculado em %.3f s, %4.2f MBps

source: %s Usage: %s [OPTION...] [FILE | -]... %s --printf=<format string> [FILE | -]...
pt_br: %s Uso: %s [OPÇÃO...] [ARQUIVO | -]... %s --printf=<cadeia de formato> [ARQUIVO | -]...

source: Options:
pt_br: Opções:

source: Print program version and exit.
pt_br: Imprimir a versão do programa e sair.

source: Print this help screen.
pt_br: Imprimir esta tela de ajuda.

source: Calculate %s checksum.
pt_br: Calcular soma de verificação %s.

source: Calculate %s message digest.
pt_br: Calcular síntese de mensagem %s.

source: Calculate and print eDonkey link.
pt_br: Calcular e imprimir link eDonkey.

source: GOST R 34.11-2012, 256 bit
pt_br: GOST R 34.11-2012, 256 bits

source: GOST R 34.11-2012, 512 bit
pt_br: GOST R 34.11-2012, 512 bits

source: Calculate all supported hash functions.
pt_br: Calcular todas as funções hash suportadas.

source: Check hash files specified by command line.
pt_br: Checar arquivos de hash especificados pela linha de comando.

source: Update the specified hash file.
pt_br: Atualizar o arquivo de hash especificado.

source: List files from hash file that are missing or inaccessible.
pt_br: Listar arquivos do arquivo de hash que estão faltando ou inacessíveis.

source: List command-line files missing from given hash file.
pt_br: Listar os arquivos da linha de comando que não estão presentes no arquivo de hash.

source: Rename files by inserting crc32 sum into name.
pt_br: Renomear arquivos pela inserção da soma crc32 no nome.

source: Verify files by crc32 sum embedded in their names.
pt_br: Verificar arquivos pela soma crc32 embutida em seus nomes.

source: List the names of supported hash functions, one per line.
pt_br: Listar os nomes de funções hash suportadas, uma por linha.

source: Benchmark selected algorithm.
pt_br: Testar o desempenho do algoritmo selecionado.

source: Be verbose.
pt_br: Ser verboso.

source: Use brief form of hash file verification report.
pt_br: Usar forma breve de relatório de verificação de arquivo de hash.

source: Process directories recursively.
pt_br: Processar diretórios recursivamente.

source: Process a list of files.
pt_br: Processar uma lista de arquivos.

source: Process the text message.
pt_br: Processar a mensagem textual.

source: Don't print OK messages for successfully verified files.
pt_br: Não imprimir mensagens OK para arquivos verificados com sucesso.

source: Ignore missing files, while verifying a hash file.
pt_br: Ignorar arquivos ausentes, ao verificar um arquivo de hash.

source: Ignore case of filenames when updating hash files.
pt_br: Ignorar se nomes de arquivos estão em maiúsculas ou em minúsculas ao atualizar arquivos de hash.

source: Show percents, while calculating or verifying message digests.
pt_br: Mostrar porcentagens, ao calcular ou verificar sínteses de mensagem.

source: Output per-file and total processing speed.
pt_br: Mostrar velocidade de processamento por arquivo e total.

source: Descend at most <n> levels of directories.
pt_br: Descer até no máximo <n> níveis de diretórios.

source: Specify hash functions to be calculated using OpenSSL.
pt_br: Especificar funções hash a calcular com OpenSSL.

source: File to output calculation or checking results.
pt_br: Arquivo de saída para registrar resultados de cálculo ou checagem.

source: File to log errors and verbose information.
pt_br: Arquivo de log para registrar erros e informações verbosas.

source: Print message digests, using SFV format (default).
pt_br: Imprimir sínteses de mensagem, usando formato SFV (padrão).

source: Print message digests, using BSD-like format.
pt_br: Imprimir sínteses de mensagem, usando formato tipo BSD.

source: Print message digests, using simple format.
pt_br: Imprimir sínteses de mensagem, usando formato simples.

source: Print one message digest per line without file information.
pt_br: Imprimir uma síntese de mensagem por linha sem informações de arquivo.

source: Print message digests in hexadecimal format.
pt_br: Imprimir sínteses de mensagem em formato hexadecimal.

source: Print message digests in Base32 format.
pt_br: Imprimir sínteses de mensagem em formato Base32.

source: Print message digests in Base64 format.
pt_br: Imprimir sínteses de mensagem em formato Base64.

source: Print message digests as magnet links.
pt_br: Imprimir sínteses de mensagem como links magnéticos.

source: Create torrent files.
pt_br: Criar arquivos torrent.

source: Use UTF-8 encoding for output (Windows only).
pt_br: Usar codificação UTF-8 para saída (somente Windows).

source: Use Windows codepage for output (Windows only).
pt_br: Usar página de código Windows para saída (somente Windows).

source: Use DOS codepage for output (Windows only).
pt_br: Usar página de código DOS para saída (somente Windows).

source: Load a printf-like template from the <file>
pt_br: Carregar um template de printf do arquivo <file>

source: Format and print message digests.
pt_br: Formatar e imprimir sínteses de mensagem.

source: See the RHash manual for details.
pt_br: Veja o manual do RHash para mais detalhes.

source: compiled without openssl support
pt_br: compilado sem suporte openssl

source: openssl option doesn't support '%s' hash function
pt_br: opção openssl não suporta função hash '%s'

source: Purrr...
pt_br: Ronrom...

source: max-depth parameter is not a number: %s
pt_br: parâmetro max-depth não é um número: %s

source: bt-piece-length parameter is not a number: %s
pt_br: parâmetro bt-piece-length não é um número: %s

source: wrong path-separator, use '//' instead of '/' on MSYS
pt_br: path-separator errado, use '//' em vez de '/' no MSYS

source: path-separator is neither '/' nor '\': %s
pt_br: path-separator não é nem '/' nem '\': %s

source: unknown option: %s
pt_br: opção desconhecida: %s

source: argument is required for option %s
pt_br: opção %s requer argumento

source: %s:%u: unknown option "%s"
pt_br: %s:%u: opção desconhecida "%s"

source: incompatible program modes
pt_br: modos de programa incompatíveis

source: incompatible formatting options
pt_br: opções de formatação incompatíveis

source: Config file: %s
pt_br: Arquivo de configuração: %s

source: skipping: %s
pt_br: pulando: %s

source: %s: template file is too big
pt_br: %s: arquivo de template é grande demais

source: %s v%s benchmarking...
pt_br: %s v%s rodando teste de desempenho...

source: no files/directories were specified at command line
pt_br: nenhum arquivo/diretório foi especificado na linha de comando

source: Usage: %s [OPTION...] <FILE>... Run `%s --help' for more help.
pt_br: Uso: %s [OPÇÃO...] <ARQUIVO>... Rode `%s --help' para mais ajuda.

source: Format string is: %s
pt_br: Cadeia de formato é: %s
